src/cf/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПоставщиками/ВзаиморасчётыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ВаловаяПрибыль</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/InformationRegisters/КураторыДоговоров/КураторыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КураторыДоговоров</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	ЦенаВключаетНДС = Истина;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		// Контроль повторного ввода по заказу снят: частичные отгрузки - по одному заказу
		// допускается несколько реализаций (решение владельца 2026-08-25).
		Дата = ТекущаяДатаСеанса();
		Основание = ДанныеЗаполнения;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		Менеджер = ДанныеЗаполнения.Менеджер;
		ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС;
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Организация = ДанныеЗаполнения.Организация;
		//Рез = Документы.ЗаказПокупателя.ПолучитьТоварыПоГруппировкам(ДанныеЗаполнения);
		//ВыбГруппа = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		//Пока ВыбГруппа.Следующий() Цикл
		//	Выб = ВыбГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//	Пока Выб.Следующий() Цикл
		//    	СтрОснование = ДанныеЗаполнения.ТЧТовары.Найти(Выб.КодСтроки, "КодСтроки");
		//		НС = ТЧТовары.Добавить();
		//		ЗаполнитьЗначенияСвойств(НС, СтрОснование);
		//	КонецЦикла;	
		//КонецЦикла;
		ТЧТовары.Загрузить(ДанныеЗаполнения.ТЧТовары.Выгрузить());
		// Цены строк - в валюте заказа.
		РаботаСВалютами.ЗаполнитьВалютуПоОснованию(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Контрагент, Организация, Истина); 
		МестоХранения = ДанныеЗаполнения.МестоХранения;
		Основание = ДанныеЗаполнения;		
		ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС;
		ТЧТовары.Загрузить(ДанныеЗаполнения.ТЧТовары.Выгрузить());
		ТЧСерии.Загрузить(ДанныеЗаполнения.ТЧСерии.Выгрузить());
		// Цены строк - в валюте поступления.
		РаботаСВалютами.ЗаполнитьВалютуПоОснованию(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Данные для проведения
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗТоварыССериями", СерииИРазмещение.ОбъединитьТоварыССериями(ЭтотОбъект));
	// Блокировки: строки реализации и всё, что возьмёт автовыпуск (E9)
	КонтекстАвтовыпуска = Производство.КонтекстАвтовыпуска(ЭтотОбъект);
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка, КонтекстАвтовыпуска);
	Блокировка.Заблокировать();
	// Автовыпуск продукции заказа на производство - на секунду раньше реализации, до её списания по ФИФО (E9)
	Производство.ОбеспечитьАвтовыпуск(ЭтотОбъект, КонтекстАвтовыпуска, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// Формируем
	Отказ = Не РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения(ЭтотОбъект);
	Если Отказ Тогда Возврат КонецЕсли;
	РегистрыНакопления.ВзаиморасчётыСПокупателями.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьПоДопРасходам(ЭтотОбъект);
	РегистрыНакопления.Продажи.СформироватьДвижения(ЭтотОбъект); // Рассчитывается на основании списанных партий и издержек
	// Записываем
	Движения.Записать();
	ПроизводственныеЗаказы.ОбновитьСтадииПослеПроведения(ЭтотОбъект);
КонецПроцедуры

// Отмена проведения документа, затронувшего заказы клиента на производство: блокировки в порядке проведения,
// распроведение автовыпуска (E9), очистка движений и пересчёт стадий заказов (E8). Без таких заказов и автовыпуска
// движения удаляет платформа, как раньше.
//
// Параметры:
//  Отказ - Булево - устанавливается, если автовыпуск лежит в закрытом периоде.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	КонтекстАвтовыпуска = Производство.КонтекстАвтовыпуска(ЭтотОбъект, Истина);
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка, КонтекстАвтовыпуска);
	Если КонтекстАвтовыпуска.Автовыпуски.Количество() > 0 Тогда
		Блокировка.Заблокировать();
		Производство.ОтменитьАвтовыпуск(ЭтотОбъект, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПроизводственныеЗаказы.ОтменитьПроведениеДокумента(ЭтотОбъект, Блокировка);
КонецПроцедуры

// Прямое удаление реализации кодом снимает её движения без ОбработкаУдаленияПроведения: автовыпуск распроводится и
// помечается на удаление, чтобы не остаться проведённым с потерянным основанием (E9).
//
// Параметры:
//  Отказ - Булево - устанавливается, если автовыпуск лежит в закрытом периоде.
//
Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	КонтекстАвтовыпуска = Производство.КонтекстАвтовыпуска(ЭтотОбъект, Истина);
	Если КонтекстАвтовыпуска.Автовыпуски.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка, КонтекстАвтовыпуска);
	Блокировка.Заблокировать();
	Производство.ОтменитьАвтовыпуск(ЭтотОбъект, Отказ, Истина);
КонецПроцедуры

// Блокировки проведения и отмены проведения - один набор в одном порядке (E8): строки реализации, остатки
// номенклатуры автовыпуска так же, как их блокирует выпуск (E9), взаиморасчёты, потребности заказов автовыпуска.
//
// Параметры:
//  Блокировка          - БлокировкаДанных - заполняемая блокировка.
//  КонтекстАвтовыпуска - Структура - см. Производство.КонтекстАвтовыпуска.
//
Процедура ЗаполнитьБлокировкуПроведения(Блокировка, КонтекстАвтовыпуска)
	Если КонтекстАвтовыпуска.Номенклатура.Количество() = 0 Тогда
		УправляемыеБлокировки.ТоварыВНаличии(Блокировка, ТЧТовары, МестоХранения);
	Иначе
		// Один элемент остатков без склада по строкам и номенклатуре автовыпуска: два элемента разной ширины у двух
		// реализаций могли бы взять блокировки встречно.
		Производство.ЗаполнитьБлокировкуОстатковАвтовыпуска(Блокировка, КонтекстАвтовыпуска, ТЧТовары);
	КонецЕсли;
	УправляемыеБлокировки.ВзаиморасчётыСПокупателями(Блокировка, Контрагент);
	Производство.ЗаполнитьБлокировкуПотребностейАвтовыпуска(Блокировка, КонтекстАвтовыпуска);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	// Для заказа контроль повторного ввода снят - частичные отгрузки (решение владельца 2026-08-25).
	Если ТипЗнч(Основание) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		РаботаСДокументами.МожноСоздатьДокументНаОсновании(Метаданные.Документы.РеализацияТоваровУслуг, Основание);
	КонецЕсли;
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	Менеджер = РегистрыСведений.КураторыДоговоров.ПолучитьПоследнее(ЭтотОбъект.Дата, Новый Структура("Договор", ЭтотОбъект.Договор)).Куратор;
	//РаботаСДокументами.ПроверкаСоответствияВозвратовРеализации(ЭтотОбъект, РежимЗаписи, Отказ);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	РаботаСВалютами.ПроверитьВалютуДокумента(ЭтотОбъект, Отказ);
	РаботаСДокументами.ЗаполнитьИтогиДокумента(ЭтотОбъект);
	Если Не Отказ Тогда
		ПроизводственныеЗаказы.ЗапомнитьЗаказыДокумента(ЭтотОбъект, РежимЗаписи);
	КонецЕсли;
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)    
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Пометка удаления непроведённой реализации переходит на её автовыпуск - до записи статусов (E9). Проведение и отмену
	// проведения обслуживают обработчики проведения.
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Производство.ПометитьАвтовыпуск(ЭтотОбъект, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЗаписатьСтатусЗаказаПродажи();
	// Проведённый документ, перезаписанный без перепроведения, пересчитывает стадии своих заказов (E8).
	ПроизводственныеЗаказы.ОбновитьСтадииПриЗаписи(ЭтотОбъект);
КонецПроцедуры

// Статус «Собран» заказа-продажи, по которому записана реализация: только из «Новый» и «В работе».
//
Процедура ЗаписатьСтатусЗаказаПродажи()
	// Статус «Собран» - только у заказа-продажи: стадию заказа на производство считает проведение (E8).
	Если ЗначениеЗаполнено(Основание) И Не ПроизводственныеЗаказы.ЭтоЗаказНаПроизводство(Основание) Тогда
		
		ЗаписыватьСтатус = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.СтатусЗаказаПокупателя КАК СтатусЗаказаПокупателя
		|ИЗ
		|	РегистрСведений.ИсторияЗаказовПокупателейПоСтатусам.СрезПоследних(, ЗаказПокупателя = &ЗаказПокупателя) КАК ИсторияЗаказовПокупателейПоСтатусамСрезПоследних
		|ГДЕ
		|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.Индикатор = """"";
		// Запись стадии (E8) у заказа, переведённого из производства в продажу, считается отсутствующей.
		Запрос.УстановитьПараметр("ЗаказПокупателя",Ссылка.Основание); 
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество() = 0 Тогда 
			ЗаписыватьСтатус = Истина;
			СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Собран;  
		Иначе 
			СтатусЗаписи = Выборка[0].СтатусЗаказаПокупателя; 
			Если СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Новый 
				или СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.ВРаботе Тогда 
				ЗаписыватьСтатус = Истина;
				СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Собран;  
			Иначе
				ЗаписыватьСтатус = Ложь;
			КонецЕсли;   
		КонецЕсли; 
		
		Если ЗаписыватьСтатус = Истина тогда
			НоваяЗапись = РегистрыСведений.ИсторияЗаказовПокупателейПоСтатусам.СоздатьМенеджерЗаписи();
			НоваяЗапись.Период = РаботаСДокументами.ПериодЗаписиСтатусаЗаказа(Ссылка.Основание);
			НоваяЗапись.СрокОплаты =  РаботаСДокументами.ПолучитьСрокОплаты(Контрагент,?(Ссылка.Пустая(),ТекущаяДата(),Дата));
			НоваяЗапись.ДокументПродажи = Ссылка;
			НоваяЗапись.ЗаказПокупателя = Ссылка.Основание;
			// Статус расчётный: запись в привилегированном режиме (ревью техдолга Codex 2026-10-09, T8).
			НоваяЗапись.СтатусЗаказаПокупателя = СтатусЗаписи;
			УстановитьПривилегированныйРежим(Истина);
			НоваяЗапись.Записать(Ложь);
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры
